app/views/groups/index.html.erb

			<div class="group_summary">
				<%= link_to group.group_name, group %><br />
---
SELECT `groups`.* FROM `groups`