app/controllers/connections_controller.rb

  def create
		contacts_array = Array.new
		if params[:commit] == "Add Connection"
			params[:send_invite][:email_contact].each {|k,v| contacts_array << v if v.length > 0 }
		  contacts_array.each do |email_contact|
		    user = User.find(email_contact)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (0, 0)