app/controllers/experiences_controller.rb

  def index
    @experiences = Experience.all
---
SELECT `experiences`.* FROM `experiences`

  def show
    @experience = Experience.find(params[:id])
---
SELECT `experiences`.* FROM `experiences` WHERE `experiences`.`id` = 1 LIMIT 1

  def create
    @experience = Experience.new(params[:experience])
    @experience.user_profile_id = current_user.user_profile.id
    respond_to do |format|
      if @experience.save
---
INSERT INTO `experiences` (`company_name`, `company_website`, `created_at`, `currently_work`, `description`, `from_month`, `from_year`, `industry_id`, `location`, `title`, `to_month`, `to_year`, `updated_at`, `user_profile_id`) VALUES ('hg', 'hgh', '2012-09-27 16:43:19', 1, 'jhj', 'hg', 2, NULL, 'hg', 'hg', 'hg', 4, '2012-09-27 16:43:19', 1)