app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def show
    @group = Group.find(params[:id])

SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
---
  def edit
    @group = Group.new
    @user_profile = UserProfile.find_by_user_id(current_user.id)
    @group = Group.find(params[:id])

INSERT INTO `groups` (`access`, `allo_invite_others`, `allow_display_logo`, `check_agreement`, `country_id`, `created_at`, `creator`, `description`, `display_in_directory`, `group_name`, `group_owner_email`, `group_type`, `language`, `open_status`, `postal_code`, `single_location`, `summary`, `updated_at`, `website`) VALUES (0, 0, 0, 1, 0, '2012-09-22 13:39:43', 1, 'This is a test description', 1, 'My Group', 'rashila_fs@yahoo.co.in', 'Alumni Group', 'English', 1, '123', 1, 'This is a test summary.', '2012-09-22 13:39:43', 'test.com')
---
  def create
    @group = Group.new(params[:group])
    @group.creator = current_user.id
    if params[:commit] == "Create an Open Group"
      @group.open_status = true
    else
      @group.open_status = false
    end
    respond_to do |format|
      if @group.save

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
UPDATE `groups` SET `open_status` = 1, `logo_file_name` = '10931-micromax-eclipse-q66-picture-big.jpg', `logo_content_type` = 'image/jpeg', `logo_file_size` = 0, `logo_updated_at` = '2012-09-23 16:47:21', `group_type` = 'Alumni Group', `group_owner_email` = 'rashila_fs@yahoo.co.in', `country_id` = 0, `postal_code` = '', `updated_at` = '2012-09-23 16:47:23' WHERE `groups`.`id` = 1
---
  def update
    @group = Group.find(params[:id])
    if params[:commit] == "Create an Open Group"
      @group.open_status = true
    else
      @group.open_status = false
    end
    respond_to do |format|
      if @group.update_attributes(params[:group])