app/controllers/qualifications_controller.rb

SELECT `qualifications`.* FROM `qualifications`
---
  def index
    @qualifications = Qualification.all

SELECT `qualifications`.* FROM `qualifications` WHERE `qualifications`.`id` = 1 LIMIT 1
---
  def show
    @qualification = Qualification.find(params[:id])

INSERT INTO `qualifications` (`created_at`, `from_year`, `institution`, `name`, `specialisation`, `to_year`, `updated_at`, `user_profile_id`) VALUES ('2012-09-27 16:42:32', 103, 'jh', 'a', 're', 118, '2012-09-27 16:42:32', 1)
---
  def create
    @qualification = Qualification.new(params[:qualification])
    @qualification.user_profile_id = current_user.user_profile.id
    respond_to do |format|
      if @qualification.save