app/controllers/user_profiles_controller.rb

  def create
    @user_profile = UserProfile.new(params[:user_profile])
    @user_profile.user_id = current_user.id
    respond_to do |format|
      if @user_profile.save
---
INSERT INTO `user_profiles` (`company`, `country_id`, `email_assoc`, `employment_status`, `industry`, `job_title`, `plan_id`, `postal_code`, `self_employed`, `user_id`) VALUES ('hjhj', 0, NULL, 0, NULL, 'k', NULL, '123', 1, 5)

  def save_skills
    params[:user_profile][:skill_ids] ||= []
    @user_profile = UserProfile.find_by_user_id(current_user.id)
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1

  def select_skills
    @user_profile = UserProfile.find_by_user_id(current_user.id)
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1

  def email_add_form
    @user_profile = UserProfile.where(:user_id => params[:user_id]).first
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 5 LIMIT 1

  def email_add
    @user_profile = UserProfile.where(:user_id => params[:user_id]).first
    respond_to do |format|
      if @user_profile.update_attribute(:email_assoc, params[:user_profile][:email_assoc])
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 5 LIMIT 1
UPDATE `user_profiles` SET `email_assoc` = 'rashila_fs@yahoo.co.in' WHERE `user_profiles`.`id` = 1

  def connect_with_form
    @user_profile = UserProfile.where(:user_id => params[:user_id]).first
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 5 LIMIT 1

  def enter_password_to_connect
		@user_profile = UserProfile.where(:user_id => params[:user_id]).first
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 5 LIMIT 1

  def show_bconnected_contacts
    #@user_profile = UserProfile.where(:user_id => params[:user_id]).first
    #@bconnected_contacts = User.where(:email => "rashilafs@gmail.com").select("email")
		if params[:user_profile][:email_assoc].split("@").last.include?("yahoo")
			 @contacts = Contacts::Yahoo.new(params[:user_profile][:email_assoc], params[:email][:password]).contacts
		elsif params[:user_profile][:email_assoc].split("@").last.include?("gmail")
			@contacts = Contacts::Gmail.new(params[:user_profile][:email_assoc], params[:email][:password]).contacts
		end
    @contacts = @contacts.map{|contact| "'"+contact[1]+"'"}
---
SELECT `user_profiles`.email_assoc as email FROM `user_profiles` WHERE `user_profiles`.`email_assoc` IN ('rashilafs@gmail.com') UNION SELECT `users`.email FROM `users` WHERE `users`.`email` IN ('rashilafs@gmail.com')

	def invite_contacts_form
		@user_profile = UserProfile.where(:user_id => params[:user_id]).first
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 5 LIMIT 1

	def show_email_contacts
		@user_profile = UserProfile.where(:user_id => params[:user_id]).first
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 5 LIMIT 1

	def enter_password_to_invite
		@user_profile = UserProfile.where(:user_id => params[:user_id]).first
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 5 LIMIT 1